Show UML graph types, progress #35
